from django.shortcuts import render


# Create your views here.


def catalog(request):
    context = {
        "title": "CLOTHING - Каталог",
        "goods": [
            {'image': 'deps/images/goods/Prada jacket.jpg',
             'name': 'Куртка Prada',
             'description': 'Re-Nylon відображає подвійність естетики \nPrada завдяки своєму інноваційному, технологічному характеру \nта вишуканому оздобленню. Ця куртка-блузон поєднує спортивну функціональність переробленого нейлону із сучасним мінімалізмом злегка утепленого силуету, доповненого культовим трикутним логотипом.',
             'price': 151000},

            {'image': 'deps/images/goods/white and gray Balenciaga sneakers.jpg',
             'name': 'Біло-сірі кросівки Balenciaga',
             'description': 'Виконані без використання шкіри, ці чоловічі кросівки поєднують сучасні матеріали — поліестер і поліуретан — створюючи інноваційний і динамічний дизайн. Ефект зношеності надає моделі характерного вигляду, а численні деталі шнурівки з логотипом Balenciaga, розміщеним по всій верхній частині та підошві, підкреслюють впізнаваний стиль. Тиснені елементи, включаючи розмір і брендування 3XL із світловідбивними деталями, додають виразності та функціональності. Продумані акценти формують універсальний і сучасний характер моделі.',
             'price': 51000},

            {'image': 'deps/images/goods/women’s jeans Gucci.jpg',
             'name': 'Жіночі джинси Gucci',
             'description': 'Образи сезону весна–літо 2026 вже представлені. Цей дизайн також є частиною колекції La Famiglia, яка переосмислює коди модного дому та висуває на перший план унікальні особистості й виразні стильові профілі. Окрім ефекту вибіленості, ці жіночі штани з сертифікованого бавовняного деніму вирізняються насамперед жакардовим візерунком GG.',
             'price': 62000},

            {'image': 'deps/images/goods/women’s jacket with gold fibers Chanel.jpg',
             'name': 'Жіночий піджак з золотистими волокнами Chanel ',
             'description': 'Витончений жакет із світлого твіду поєднує класичну елегантність із делікатним золотистим блиском у фактурі тканини. Декоративні ґудзики, обробка країв і накладні кишені додають виробу вишуканості та підкреслюють його преміальний стиль.',
             'price': 570000},

            {'image': 'deps/images/goods/women’s jacket Chanel.jpg',
             'name': 'Жіночій піджак Chanel ',
             'description': 'Елегантний костюм із фактурного твіду поєднує класичний крій із сучасними деталями, створюючи витончений і впевнений образ. Жакет із декоративною обробкою та спідниця гармонійно доповнюються невеликою бордовою сумкою, додаючи образу розкоші.',
             'price': 388636},

            {'image': 'deps/images/goods/Prada jacket.jpg',
             'name': 'Пиджак Прада',
             'description': 'Вишукана конструкція цього індивідуально пошитого жакета бренду Prada поєднує виразні лінії та позачасові елегантні деталі. Виріб із вовни має злегка приталений, двобортний силует, який доповнений гострими лацканами.!',
             'price': 171000},

            {'image': 'deps/images/goods/men’s red balenciaga t-shirt.jpg',
             'name': 'Чоловіча червона футболка Balenciaga',
             'description': 'Виконана з щільного сухого джерсі, ця модель поєднує комфорт і мінімалістичний дизайн. Круглий виріз і короткі рукави підкреслюють класичний силует, а вишивка з курсивним написом на передній частині додає витонченого акценту. Лаконічні деталі формують універсальний і сучасний характер виробу.',
             'price': 30831},

            {'image': 'deps/images/goods/men’s brown bathrobe Prada.jpg',
             'name': 'Чоловічий халат коричневий Prada',
             'description': 'Цей халат із м’якого кашеміру має класичний силует із поясом, що поєднує комфорт і вишуканість. Теплий і затишний виріб доповнений трикутним логотипом.',
             'price': 259091},

            {'image': 'deps/images/goods/women’s burgundy blue Prada jacket.jpg',
             'name': 'Жіноча бордово-голуба кофта Prada',
             'description': 'Дизайн у стилі colorblock визначає це поло, яке поєднує ретро-спортивний настрій із характерними деталями Prada, такими як логотип-етикетка спереду та об’ємний силует у сучасному стилі.',
             'price': 57000},

            {'image': 'deps/images/goods/women’s keychain Gucci.jpg',
             'name': 'Жіночий брелок Gucci',
             'description': 'У межах колекції осінь–зима 2025 року представлені аксесуари з фантазійними мотивами. Цей брелок поєднує деталь із GG-шкіри у формі собаки зі світло-золотистим подвійним логотипом G.',
             'price': 20209},

            {'image': 'deps/images/goods/women’s pajama with leopard print Victoria’s Secret.jpg',
             'name': 'Жіноча піжама з принтом леопарда Victorias Secret',
             'description': 'Зануртесь у розкіш. Наші найпопулярніші піжами вирізняються сяючим блиском і ідеально комфортною посадкою — у лімітованих кольорах і принтах, які ви точно захочете мати всі. Цей комплект поєднує елегантність і невимушений комфорт, створюючи сучасне бачення домашнього одягу, де витончені матеріали та продуманий дизайн формують відчуття стилю навіть у повсякденних моментах.',
             'price': 4700},

            {'image': 'deps/images/goods/Women’s panama Miu Miu.jpg',
             'name': 'Жіноча Панама Miu Miu',
             'description': 'Літні екзотичні мотиви визначають дизайн цього нового капелюха з тканого матеріалу. Рустикальна текстура підкреслюється контрастним логотипом, який надає моделі знакової та впізнаваної виразності.',
             'price': 27460},
        ]
    }

    return render(request, "goods/catalog.html", context)


def product(request):
    return render(request, "goods/product.html")
